//? ця функція не приймає ніяких аргументів і вона потрібна для того щоб ніхто не чепав main.js 
//? функція потрібна як обгортка для всієї логіки
//? вся логіка знаходиться всередині
//? ви маєте папку (для своїх JS файлів) в ній, при необхідності, можете створювати інші JS файли (залежно від завдання) і виклик тих функцій повинен бути в основній функції, тобто вы можете написати всередині цієї функції безліч інших функцій, або їх виклики
//? якщо все зрозуміло, то можете видалити ці повідомлення

//? функціонал - зміна теми, мобільне меню

//your imports is here (if you have)

//

export function header () {
	console.log('hello world from header');
	// your code is here ⏬'
}